# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/bundle'
tap 'remotemobprogramming/brew'

#Binaries
# brew 'zsh'
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'git'
brew 'grep'
brew 'httpie'
brew 'tree'
brew 'autojump'
brew 'zsh-autosuggestions'
brew 'bat'
brew 'bpytop'
brew 'htop'
brew 'ctop'
brew 'exa'
brew 'fswatch'
brew 'thefuck'
brew 'watch'
brew 'wget'
brew 'remotemobprogramming/brew/mob'
brew 'icdiff'
brew 'jq'
brew 'macvim'
brew 'jenv'
brew 'pgcli'

# Apps
cask 'iterm2'
cask 'docker'
cask 'slack'
cask 'zoom'
cask 'microsoft-teams'
cask 'tuple'
cask 'jetbrains-toolbox'
cask 'drawio'
cask 'miro'
cask 'whatsapp'
cask 'postman'
cask 'krisp'
cask 'launchbar'
cask 'kaleidoscope'

# Fonts
brew 'svn' # necessary for the fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'



